#   Data analysis and manipulation with pandas
***

Data manipulation and analysis are key tasks in any data science or data analysis project. Pandas provides a wide range of functions for data manipulation and analysis, making it easier to clean,transform and extract insights from data. In this notebook, i will cover various data manipulation and analysis techniques using pandas.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data.csv")

In [3]:
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [4]:
## To get statistical summary of the data we can use .describe(). It works only for numerical columns or values
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [5]:
## to get the data types of the columns or features we can use .dtypes
df.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

## Handling missing values
***

In [11]:
## to get missing values we can directly use .isnull()
df.isnull()
## values will be marked as True if they are missing.
## to get missing value in particular label/column use .any() with isnull()
df.isnull().any()
## we can give axis=1 (by default its 0) to get row which is null
df.isnull().any(axis=1)
## we can get total count of null values in each label/columns using .sum() chained with isnull()
df.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

## Fill the missing values
***

In [14]:
## To fill the missing data use .fillna(value). Always create new dataframe with filled value instead of overwriting the old file
df_filled = df.fillna(0)
## usually we dont fill just zero but good way is to fill it with mean of the column
df["Sales_fillNA"] = df["Sales"].fillna(df["Sales"].mean())
df.head()

         Date Category  Value   Product  Sales Region  Sales_fillNA
0  2023-01-01        A   28.0  Product1  754.0   East         754.0
1  2023-01-02        B   39.0  Product3  110.0  North         110.0
2  2023-01-03        C   32.0  Product2  398.0   East         398.0
3  2023-01-04        B    8.0  Product1  522.0   East         522.0
4  2023-01-05        B   26.0  Product3  869.0  North         869.0

In [ ]:
## Convert one datatype into other using astype(data_type), if there are any empty values remember to fill those first (basic chaining)
df['int_Value'] = df['Value'].fillna(df['Value'].mean()).astype(int)
df.head()

         Date Category  Value   Product  Sales Region  Sales_fillNA  int_Value
0  2023-01-01        A   28.0  Product1  754.0   East         754.0         28
1  2023-01-02        B   39.0  Product3  110.0  North         110.0         39
2  2023-01-03        C   32.0  Product2  398.0   East         398.0         32
3  2023-01-04        B    8.0  Product1  522.0   East         522.0          8
4  2023-01-05        B   26.0  Product3  869.0  North         869.0         26

In [19]:
## apply some function to any column by using apply(function/lambda expression)
df['apply_Value'] = df["Value"].apply(lambda x: x*2)
df.head()

,Date,Category,Value,Product,Sales,Region,Sales_fillNA,int_Value,apply_Value
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28,56.0
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39,78.0
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,32,64.0
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,8,16.0
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,26,52.0

## Data aggregating and Grouping
***

In [20]:
## we group the data by any column to get the data from it
grouped_value_mean = df.groupby("Product")["Value"].mean()
print(grouped_value_mean)

Product
Product1    46.214286
Product2    52.800000
Product3    55.166667
Name: Value, dtype: float64

In [21]:
## we can group by multiple feature/column using list 
grouped_multiple_value_sum = df.groupby(["Product", "Region"])["Value"].sum()
print(grouped_multiple_value_sum)

Product   Region
Product1  East      292.0
          North       9.0
          South     100.0
          West      246.0
Product2  East       56.0
          North     127.0
          South     181.0
          West      428.0
Product3  East      202.0
          North     203.0
          South     215.0
          West      373.0
Name: Value, dtype: float64

In [22]:
## we can aggregate multiple in-built functions
grouped_aggregate = df.groupby('Region')["Value"].agg(["mean","sum","count"])
print(grouped_aggregate)

             mean     sum  count
Region
East    42.307692   550.0     13
North   37.666667   339.0      9
South   62.000000   496.0      8
West    61.588235  1047.0     17

## Merging and Joining data
***

In [23]:
df1 = pd.DataFrame({
    "Key":['A','B','C'],
    "Value": [10,20,30]
})
df1

  Key  Value
0   A     10
1   B     20
2   C     30

In [24]:
custom_data = [
    {"Key": 'A', "Value": 20},
    {"Key": 'B', "Value": 30},
    {"Key": 'D', "Value": 10},
]
df2 = pd.DataFrame(custom_data)
df2

  Key  Value
0   A     20
1   B     30
2   D     10

In [ ]:
## To merge two dataframes on key feature
pd.merge(df1,df2,on="Key",how="inner")
## inner join = takes similar values present in two dataframes

  Key  Value_x  Value_y
0   A       10       20
1   B       20       30

In [ ]:
## outer join gets both tables values
pd.merge(df1,df2,on="Key",how="outer")

  Key  Value_x  Value_y
0   A     10.0     20.0
1   B     20.0     30.0
2   C     30.0      NaN
3   D      NaN     10.0

In [28]:
## left join, more priority to first table
pd.merge(df1,df2,on="Key",how="left")

  Key  Value_x  Value_y
0   A       10     20.0
1   B       20     30.0
2   C       30      NaN

In [29]:
## right join, more priority to second table
pd.merge(df1,df2,on="Key",how="right")

  Key  Value_x  Value_y
0   A     10.0       20
1   B     20.0       30
2   D      NaN       10